#include <iostream>
#include <string>

std::string ones[] = { "", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять",
                  "десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять",
                  "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять" };

std::string tens[] = { "", "", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят",
                  "вісімдесят", "дев'яносто" };

std::string hundreds[] = { "", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот",
                      "вісімсот", "дев'ятсот" };

std::string convert(int n) {
	if (n == 1000) {
		return "тисяча";
	}

	std::string result = "";
	if (n >= 100) {
        result += hundreds[n / 100];
        n %= 100;
        if (n > 0) result += " ";
    }

    if (n >= 20) {
        result += tens[n / 10];
        n %= 10;
        if (n > 0) result += " ";
    }

    if (n > 0) {
        result += ones[n];
    }

    return result;
}

int main() {
    int n;
    std::cout << "Введіть число (від 1 до 1000): ";
    std::cin >> n;

    if (n < 1 || n > 1000) {
        std::cout << "Число має бути від 1 до 1000." << std::endl;
    } else {
        std::cout << convert(n) << std::endl;
    }

    return 0;
}

